{"_meta": {"sources": [{"json": "TfI", "abbreviation": "TfI", "full": "Tales from Ivory", "authors": ["TestaDiRapa"], "version": "0.2.3", "url": "https://talesofivory.it/"}], "dateLastModified": 1696789237}, "race": [{"name": "Zoomorphic", "source": "Tales from Ivory", "ability": [{"choose": {"weighted": {"from": ["str", "dex", "con", "int", "wis", "cha"], "weights": [2, 1]}}}, {"choose": {"weighted": {"from": ["str", "dex", "con", "int", "wis", "cha"], "weights": [1, 1, 1]}}}], "size": ["M", "S"], "darkvision": 60, "speed": {"walk": 30}, "skillProficiencies": [{"any": 1}], "languageProficiencies": [{"common": true, "any": 1}], "entries": [{"name": "Natural Weapon", "entries": ["You have a natural weapon that you can use to make unarmed strikes. You can add your Dexterity modifier, instead of your Strength modifier, to the attack and damage rolls when you attack with this Natural Weapon. It deals 1d6 Bludgeoning, Piercing or Slashing damage on a hit (choose when you select this race)."], "type": "entries"}, {"name": "Darkvision", "type": "entries", "entries": ["You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."]}, {"name": "Languages", "entries": ["You can speak, read, and write Common and one other language that you and your DM agree is appropriate for your character."], "type": "entries"}, {"name": "Animal Features", "entries": ["When you choose this race, you gain one common trait and one special trait. You must choose traits that suit the zoomorphic you are (it’s hard that a zoomorphic fish has a climber or flight trait).", "Common Traits:", {"type": "list", "items": [{"type": "entries", "name": "Amphibious", "entries": ["You can breathe air and water, and you gain a swim speed equal to your walking speed."]}, {"type": "entries", "name": "BlindSight", "entries": ["You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you."]}, {"type": "entries", "name": "Charge", "entries": ["Immediately after you take the Dash action on your turn and move at least 20 feet, you can make one melee attack with your Natural Weapon as a bonus action. If you hit, you deal an extra 1d6 damage to the target."]}, {"type": "entries", "name": "Climber", "entries": ["You have a climb speed equal to your walking speed."]}, {"type": "entries", "name": "Dexterous Limb", "entries": ["As a bonus action, you can use your limbs (like feets or a tail) to manipulate an object, open or close a door or container, or pick up or set down a Tiny object."]}, {"type": "entries", "name": "Fleet of Foot", "entries": ["Your base walking speed increases to 35 feet."]}, {"type": "entries", "name": "Hunting Game", "entries": ["You can add your proficiency bonus to your initiative rolls."]}, {"type": "entries", "name": "Keen Sense", "entries": ["You have advantage on Wisdom (Perception), Wisdom (Survival), and Intelligence (Investigation) checks that involve hearing, smell or sight (choose when you select this race)."]}, {"type": "entries", "name": "Mimetic", "entries": ["You are proficient in Stealth Skill. As an action, you can change the color of your skin or carapace to match the color and texture of your surroundings, giving you advantage on Dexterity (Stealth) checks made to hide in those surroundings."]}, {"type": "entries", "name": "Mimicry (only Flight or Smart)", "entries": ["You can accurately mimic sounds you have heard, including voices. A creature that hears the sounds you make can tell they are imitations only with a successful Wisdom (Insight) check against a DC of 8 + your proficiency bonus + your Charisma modifier."]}, {"type": "entries", "name": "Ranged", "entries": ["Your Natural Weapon becomes a ranged weapon with a normal range of 15 feet and a long range of 30 feet. You can use your Dexterity or Strength modifier to its attack and damage rolls. Being within 5 feet of a hostile creature doesn’t impose disadvantage on these Natural Weapon rolls."]}, {"type": "entries", "name": "Reach", "entries": ["When you make a melee attack with your Natural Weapon, your reach for it is 5 feet greater than normal."]}]}, "Special Traits:", {"type": "list", "items": [{"type": "entries", "name": "Flight", "entries": ["Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."]}, {"type": "entries", "name": "Clencher", "entries": ["When you hit a creature or an uncarried and unworned object with a melee Natural Weapon attack, you can grapple it. You can have only one creature or object grappled in this way. You have advantage on attack rolls against creatures grappled in this way. If you are grappling a creature or an object, you can still make attacks with your Natural Weapons but only against it."]}, {"type": "entries", "name": "Hungry Jaws", "entries": ["You can throw yourself into a feeding frenzy. As a bonus action, you can make a special attack with your Natural Weapon. If the attack hits, it deals its normal damage, and you gain temporary hit points equal to your proficiency bonus. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."]}, {"type": "entries", "name": "Massive Build", "entries": ["You have advantage on Strength-based ability checks and Strength saving throws. In addition, you count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."]}, {"type": "entries", "name": "Natural Armor", "entries": ["You have tough, scaly skin. Bludgeoning, piercing, and slashing damage that you take from non-magical attacks is reduced by 2. When you aren't wearing any armor, your base AC is 13 + Constitution modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."]}, {"type": "entries", "name": "Prodigious Leap", "entries": ["As a bonus action, you can jump a number of feet equal to five times your proficiency bonus, without provoking opportunity attacks. You can use this trait only if your speed is greater than 0. You can use it a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."]}, {"type": "entries", "name": "Smart", "entries": ["Thanks to your supernaturally good memory, you have proficiency in one skill or tool of your choice. Moreover, when you make an ability check using any skill in which you have proficiency, you can give yourself advantage on the check before rolling the d20. You can give yourself advantage in this way a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."]}, {"type": "entries", "name": "Sprinter", "entries": ["Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."]}, {"type": "entries", "name": "Venomous", "entries": ["You have advantage on saving throws against poison, and you have resistance against poison damage. When you hit a creature with your Natural Weapon unleash poison from it. The target makes a Constitution saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d6 poison damage. On a successful save, it takes half as much damage. This damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6). You can use this poison a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."]}]}], "type": "entries"}], "hasFluff": false, "hasFluffImages": false}], "subrace": [], "subclass": [{"name": "Path of the Ram", "source": "TfI", "className": "Barbarian", "classSource": "PHB", "shortName": "Ram", "subclassFeatures": ["Steelhead|Barbarian|PHB|Path of the Ram|TfI|3", "Ramming Brute|Barbarian|PHB|Path of the Ram|TfI|3", "Siege Machine|Barbarian|PHB|Path of the Ram|TfI|6", "Mighty Juggernaut|Barbarian|PHB|Path of the Ram|TfI|6", "Trampling Fury|Barbarian|PHB|Path of the Ram|TfI|10", "Unstoppable|Barbarian|PHB|Path of the Ram|TfI|14"]}, {"name": "Oath of Ruin", "source": "TfI", "className": "Paladin", "classSource": "PHB", "shortName": "Ruin", "subclassFeatures": ["Tenets of Ruin|Paladin|PHB|Oath of Ruin|TfI|3", "Oath Spells|Paladin|PHB|Oath of Ruin|TfI|3", "Channel Divinity|Paladin|PHB|Oath of Ruin|TfI|3", "Aura of Caducity|Paladin|PHB|Oath of Ruin|TfI|7", "No Exceptions|Paladin|PHB|Oath of Ruin|TfI|15", "Emissary of Ruin|Paladin|PHB|Oath of Ruin|TfI|20"], "subclassSpells": ["bane", "ray of sickness", "blindness/deafness", "ray of enfeeblement", "bestow curse", "hunger of hadar", "blight", "shadow of moil|xge", "contagion", "cloudkill"]}, {"name": "Oath of Liberation", "source": "TfI", "className": "Paladin", "classSource": "PHB", "shortName": "Liberation", "subclassFeatures": ["Tenets of Liberation|Paladin|PHB|Oath of Liberation|TfI|3", "Oath Spells|Paladin|PHB|Oath of Liberation|TfI|3", "Channel Divinity|Paladin|PHB|Oath of Liberation|TfI|3", "Aura of Liberty|Paladin|PHB|Oath of Liberation|TfI|7", "Unbound Unbent Unbroken|Paladin|PHB|Oath of Liberation|TfI|15", "Savior of the Oppressed|Paladin|PHB|Oath of Liberation|TfI|20"], "subclassSpells": ["heroism", "zephyr strike|xge", "blur", "pass without trace", "fly", "thunder step|xge", "freedom of movement", "polymorph", "mislead", "passwal"]}], "subclassFeature": [{"name": "Steelhead", "source": "TfI", "className": "Barbarian", "classSource": "PHB", "subclassShortName": "Path of the Ram", "subclassSource": "TfI", "level": 3, "entries": ["Starting at 3rd level, you can roll a d6 in place of the normal damage of your unarmed strike.", "If you aren't wielding any weapons or a shield when you make an attack roll, the d6 becomes a d8."]}, {"name": "Ramming Brute", "source": "TfI", "className": "Barbarian", "classSource": "PHB", "subclassShortName": "Path of the Ram", "subclassSource": "TfI", "level": 3, "entries": ["At 3rd level, while you're raging, you gain the following benefits:", {"type": "list", "items": ["You can't be knocked prone or moved on the ground against your will.", "If you move at least 10 feet in a straight line immediately before taking the Attack action, The first creature, object or structure you hit with a melee weapon attack this turn takes extra bludgeoning damage equal to 1d6 + your Strength modifier. This damage becomes 2d6 + your Strength modifier at level 10.", "if you move at least 10 feet in a straight line, you can use a bonus action to try to shove a creature within your reach."]}]}, {"name": "Siege Machine", "source": "TfI", "className": "Barbarian", "classSource": "PHB", "subclassShortName": "Path of the Ram", "subclassSource": "TfI", "level": 6, "entries": ["Starting at 6th level, your melee weapon attacks deal an extra 1d8 damage to constructs, and deal double damage to objects and structures."]}, {"name": "Mighty Juggernaut", "source": "TfI", "className": "Barbarian", "classSource": "PHB", "subclassShortName": "Path of the Ram", "subclassSource": "TfI", "level": 6, "entries": ["Starting at 6th level, while you're raging you ignore difficult terrains and you can try to shove creatures up to two sizes larger than you."]}, {"name": "Trampling Fury", "source": "TfI", "className": "Barbarian", "classSource": "PHB", "subclassShortName": "Path of the Ram", "subclassSource": "TfI", "level": 10, "entries": ["Starting at 10th level, you can move through the space of a prone creature. When you do, the target must make a Dexterity Saving Throw (DC equal to 8 + your proficiency bonus + your Strength modifier). On a failed save the creature takes bludgeoning damage equal to 2d6 + your Strength modifier, or half as much damage on a successful one. A target can only take this damage once per turn."]}, {"name": "Unstoppable", "source": "TfI", "className": "Barbarian", "classSource": "PHB", "subclassShortName": "Path of the Ram", "subclassSource": "TfI", "level": 14, "entries": ["At 14th level, your fury in battle makes you unstoppable. While you’re raging, your speed cannot be reduced, and you are immune to the frightened, paralyzed, prone, and stunned conditions.", "If you are frightened, paralyzed, or stunned, you can still use a bonus action to enter a rage (even if you can’t otherwise take actions). You aren’t affected by any of these conditions while you’re raging."]}, {"name": "Tenets of Ruin", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Ruin", "subclassSource": "TfI", "level": 3, "entries": ["The Tenets of Ruin teach to the paladin that life is the most precious good and that no one can rule it. The moral of every meaningful story is in its end.", {"type": "list", "items": [{"type": "entries", "name": "Caducity.", "entries": "All are ephemeral. All things must end. That's what makes them precious. Enjoy the present."}, {"type": "entries", "name": "Resilience.", "entries": "Endure age, plagues, injuries and despair. What doesn't kill you makes you stronger."}, {"type": "entries", "name": "Humility.", "entries": "Before Death, we are all the same. Sometimes you have to remind others of this lesson."}, {"type": "entries", "name": "Legacy.", "entries": "In the end, even you must die. Before the time comes, make sure your purposes are fulfilled and your deeds remembered."}]}]}, {"name": "Oath Spells", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Ruin", "subclassSource": "TfI", "level": 3, "entries": ["You gain oath spells at the paladin levels listed.", {"type": "table", "colLabels": ["Class Level", "Spell"], "colStyles": ["col-4 text-center", "col-8 text-left"], "rows": [["3rd", "{@spell bane}, {@spell ray of sickness}"], ["5th", "{@spell blindness/deafness}, {@spell ray of enfeeblement}"], ["9th", "{@spell bestow curse}, {@spell hunger of hadar}"], ["13th", "{@spell blight}, {@spell shadow of moil|xge}"], ["17th", "{@spell contagion}, {@spell cloudkill}"]]}]}, {"name": "Channel Divinity", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Ruin", "subclassSource": "TfI", "level": 3, "entries": ["When you take this oath at 3rd level, you gain the following two Channel Divinity options.", {"type": "list", "items": [{"type": "entries", "name": "Bringer of Decay.", "entries": "As a bonus action, you can use your Channel Divinity to invoke the ineluctable decay of all things. For 1 minute, all melee attacks you make deal an extra 1d4 necrotic damage. A creature that suffers this damage must make a Constitution save. On a failed save, it is also  poisoned for 1 minute. At the end of each of its turns, the creature can make a Constitution save. On a successful save, it is no longer  poisoned and that creature cannot be  poisoned again by this effect for 24h."}, {"type": "entries", "name": "Taste of Misery.", "entries": "You can use your Channel Divinity to remind your enemies that life sometimes could be cruel. As a reaction when a creature you can see within 30 ft of you makes a successful saving throw, you can force it to reroll the d20 and use the lower roll."}]}]}, {"name": "Aura of Caducity", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Ruin", "subclassSource": "TfI", "level": 7, "entries": ["Starting from 7th level, you are surrounded by an aura of 10ft (3m) of mortality that weakens any mortal being. Hostile creatures in this area have their movement speeds halved and if they would regain any hit points, thay regain half that amount instead.", "At 18th level, the range of this aura increases to 30ft (9m)."]}, {"name": "No Exceptions", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Ruin", "subclassSource": "TfI", "level": 15, "entries": ["At 15th level, your attacks and spells you cast ignore resistance to poison and necrotic damage. Creatures immune to these damage types still take half damage."]}, {"name": "Emissary of Ruin", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Ruin", "subclassSource": "TfI", "level": 20, "entries": ["At 20th level, as a bonus action, you become the incarnation of ruin itself for 1 minute. You gain the following benefits:", {"type": "list", "items": ["You are immune to poison and necrotic damage and the poisoned condition.", "If a hostile creature starts its turn within 10 ft of you, it takes 10 necrotic damage.", "Once per turn, as an action, you can make a melee spell attack against a non magical object that is Huge or smaller. The touched object rot, spoils, rust and finally it crumbles into ashes. If the object is carried or worned by a creature, you have to make the attack against the AC of the creature who is carrying or worning it."]}, "Once you use this feature, you can't use it again until you finish a long rest, unless you expend a 5th-level spell slot to use it again."]}, {"name": "Tenets of Liberation", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Liberation", "subclassSource": "TfI", "level": 3, "entries": ["The Tenets of Liberation teach to the paladin that freedom and free will are the most precious goods and that no one negates them to anyone. Tyranny is a crime, Slavery is a heresy.", {"type": "list", "items": [{"type": "entries", "name": "Freedom.", "entries": "Everyone is born free. Everyone deserves to choose his path."}, {"type": "entries", "name": "Rebellion", "entries": "Fight tyranny, free the oppressed. Defend those who can't defend themself."}, {"type": "entries", "name": "Respect.", "entries": "Your freedom ends where that of others begins. Be respectful."}, {"type": "entries", "name": "Responsibility.", "entries": "You are responsible for your own actions. Being free is an honor and a duty."}]}]}, {"name": "Oath Spells", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Liberation", "subclassSource": "TfI", "level": 3, "entries": ["You gain oath spells at the paladin levels listed.", {"type": "table", "colLabels": ["Class Level", "Spell"], "colStyles": ["col-4 text-center", "col-8 text-left"], "rows": [["3rd", "{@spell heroism}, {@spell zephyr strike|xge}"], ["5th", "{@spell blur}, {@spell pass without trace}"], ["9th", "{@spell fly}, {@spell thunder step|xge}"], ["13th", "{@spell freedom of movement}, {@spell polymorph}"], ["17th", "{@spell mislead}, {@spell passwal}"]]}]}, {"name": "Channel Divinity", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Liberation", "subclassSource": "TfI", "level": 3, "entries": ["When you take this oath at 3rd level, you gain the following two Channel Divinity options.", {"type": "list", "items": [{"type": "entries", "name": "Incite Rebellion.", "entries": "As a Bonus action, choose another friendly creature you can see within 30ft. The target can spend its reaction to make a single melee attack against a creature within 5 ft of it. If the target is grappled or restrained, it gains advantage on this attack."}, {"type": "entries", "name": "Unshackled.", "entries": "As a bonus action, you can target a creature you can see within 30 ft and use your channel divinity. The target automatically free from restraints, manacles, magical binds or a creature that has it grappled."}]}]}, {"name": "Aura of Liberty", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Liberation", "subclassSource": "TfI", "level": 7, "entries": ["As a bonus action, you can target a creature you can see within 30 ft and use your channel divinity. The target automatically free from restraints, manacles, magical binds or a creature that has it grappled.", "At 18th level, the range of this aura increases to 30ft (9m)."]}, {"name": "Unbound Unbent Unbroken", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Liberation", "subclassSource": "TfI", "level": 15, "entries": ["You are a free soul that no one can bend. Beginning at 15th level, you ignore difficult terrains and your speed cannot be reduced in any way.", "When you are prone, standing up uses only 5 feet of your movement."]}, {"name": "Savior of the Oppressed", "source": "TfI", "className": "Paladin", "classSource": "PHB", "subclassShortName": "Oath of Liberation", "subclassSource": "TfI", "level": 20, "entries": ["You become the very incarnation of the Principle of Liberty itself. As a bonus action, you gain the following benefits for 10 minutes:", {"type": "list", "items": ["You are immune to charmed, stunned, paralyzed, petrified and restrained conditions.", "You gain a flying speed of 60ft and you can hover.", "As a bonus action, you can touch a willing creature within 5ft and teleport it to an unoccupied space of your choice that you can see within 30ft."]}, "Once you use this feature, you can’t use it again until you finish a long rest, unless you expend a 5th-level spell slot to use it again."]}], "optionalfeature": [{"name": "Summon the Living Tide", "source": "TfI", "featureType": ["EI"], "prerequisite": [{"level": {"level": 5, "class": {"name": "Warlock"}}}], "additionalSpells": [{"innate": {"_": {"daily": {"1e": ["conjure animals"]}}}}], "entries": ["You can cast {@spell conjure animals} without using a spell slot. When you do, you can add the following options at the summoning list of the spell:", {"type": "list", "items": ["One swarm of tiny beasts of CR 1", "Two swarms of tiny beasts of CR ½", "Four swarms of tiny beasts of CR ¼"]}, "Once you do so, you can't cast it  in this way again until you finish a long rest."]}], "feat": [{"name": "Die Hard", "source": "iRdW", "icon": "icons/skills/wounds/injury-pain-body-orange.webp", "entries": ["\"You really don't die, do you motherfucker?\"", "You gain the following benefits:", {"type": "list", "items": ["Increase your Constitution score by 1, to a maximum of 20.", "You have advantage in Death Saving Throws.", "When you are at 0 hit points and you regain hit points, you can spend one hit die, roll it, and regain extra hit points equal to the number rolled + your Constitution Modifier (minimum 1)."]}, "FAQ: Effects that say that when you are reduced to 0 hp you drop to 1 instead, actually don't trigger this feat."], "prerequisite": [], "ability": [{"choose": {"from": ["con", "str"], "amount": 1}}]}, {"name": "Shaft Specialist", "source": "iRdW", "icon": "icons/skills/melee/strike-polearm-light-orange.webp", "entries": ["You have learned the secrets of how to wield a polearm with unrivaled grace and precision.", "You gain the following benefits:", {"type": "list", "items": ["Increase your Strength or Dexterity score by 1, to a maximum of 20.", "While you are holding a quarterstaff, a spear, a glaive, an helberd or a pike with two hands, you gain a +1 bonus to Armor Class.", "A quarterstaff, a spear, a glaive, an helberd or a pike has the finesse property when you wield them."]}], "prerequisite": [], "ability": [{"choose": {"from": ["str", "dex"], "amount": 1}}]}, {"name": "Dual Weapon Master ", "source": "iRdW", "icon": "icons/skills/melee/weapons-crossed-swords-yellow.webp", "entries": ["Il tuo rigoroso addestramento nel combattimento con due armi ti permette di compiere attacchi rapidi e letali tenendo alta la guardia.", {"type": "list", "items": ["Quando combatti con due armi ed effettui l'azione di attacco, puoi effettuare l'attacco aggiuntivo dell'arma secondaria come parte dell'azione di attacco invece di utilizzare l'azione bonus.", "Come azione bonus, mentre brandisci due armi, puoi imporre svantaggio al prossimo attacco in mischia rivolto verso di te fino all'inizio del tuo prossimo turno.", "Puoi estrarre o riporre un'arma ad una mano come azione bonus."]}], "prerequisite": []}], "spell": []}