{
    "name": "Zoomorphic",
    "source": "TfI",
    "ability": [
        {
            "choose": {
                "weighted": {
                    "from": [
                        "str",
                        "dex",
                        "con",
                        "int",
                        "wis",
                        "cha"
                    ],
                    "weights": [
                        2,
                        1
                    ]
                }
            }
        },
        {
            "choose": {
                "weighted": {
                    "from": [
                        "str",
                        "dex",
                        "con",
                        "int",
                        "wis",
                        "cha"
                    ],
                    "weights": [
                        1,
                        1,
                        1
                    ]
                }
            }
        }
    ],
    "size": [
        "M",
        "S"
    ],
    "darkvision": 60,
    "speed": {
        "walk": 30
    },
    "skillProficiencies": [
        {
            "any": 1
        }
    ],
    "languageProficiencies": [
        {
            "common": true,
            "any": 1
        }
    ],
    "entries": [
        {
            "name": "Natural Weapon",
            "entries": [
                "You have a natural weapon that you can use to make unarmed strikes. You can add your Dexterity modifier, instead of your Strength modifier, to the attack and damage rolls when you attack with this Natural Weapon. It deals 1d6 Bludgeoning, Piercing or Slashing damage on a hit (choose when you select this race)."
            ],
            "type": "entries"
        },
        {
            "name": "Darkvision",
            "type": "entries",
            "entries": [
                "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            ]
        },
        {
            "name": "Languages",
            "entries": [
                "You can speak, read, and write Common and one other language that you and your DM agree is appropriate for your character."
            ],
            "type": "entries"
        },
        {
            "name": "Animal Features",
            "entries": [
                "When you choose this race, you gain one common trait and one special trait. You must choose traits that suit the zoomorphic you are (it’s hard that a zoomorphic fish has a climber or flight trait).",
                "Common Traits:",
                {
                    "type": "list",
                    "items": [
                        {
                            "type": "entries",
                            "name": "Amphibious",
                            "entries": [
                                "You can breathe air and water, and you gain a swim speed equal to your walking speed."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "BlindSight",
                            "entries": [
                                "You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Charge",
                            "entries": [
                                "Immediately after you take the Dash action on your turn and move at least 20 feet, you can make one melee attack with your Natural Weapon as a bonus action. If you hit, you deal an extra 1d6 damage to the target."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Climber",
                            "entries": [
                                "You have a climb speed equal to your walking speed."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Dexterous Limb",
                            "entries": [
                                "As a bonus action, you can use your limbs (like feets or a tail) to manipulate an object, open or close a door or container, or pick up or set down a Tiny object."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Fleet of Foot",
                            "entries": [
                                "Your base walking speed increases to 35 feet."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Hunting Game",
                            "entries": [
                                "You can add your proficiency bonus to your initiative rolls."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Keen Sense",
                            "entries": [
                                "You have advantage on Wisdom (Perception), Wisdom (Survival), and Intelligence (Investigation) checks that involve hearing, smell or sight (choose when you select this race)."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Mimetic",
                            "entries": [
                                "You are proficient in Stealth Skill. As an action, you can change the color of your skin or carapace to match the color and texture of your surroundings, giving you advantage on Dexterity (Stealth) checks made to hide in those surroundings."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Mimicry (only Flight or Smart)",
                            "entries": [
                                "You can accurately mimic sounds you have heard, including voices. A creature that hears the sounds you make can tell they are imitations only with a successful Wisdom (Insight) check against a DC of 8 + your proficiency bonus + your Charisma modifier."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Ranged",
                            "entries": [
                                "Your Natural Weapon becomes a ranged weapon with a normal range of 15 feet and a long range of 30 feet. You can use your Dexterity or Strength modifier to its attack and damage rolls. Being within 5 feet of a hostile creature doesn’t impose disadvantage on these Natural Weapon rolls."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Reach",
                            "entries": [
                                "When you make a melee attack with your Natural Weapon, your reach for it is 5 feet greater than normal."
                            ]
                        }
                    ]
                },
                "Special Traits:",
                {
                    "type": "list",
                    "items": [
                        {
                            "type": "entries",
                            "name": "Flight",
                            "entries": ["Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Clencher",
                            "entries": [
                                "When you hit a creature or an uncarried and unworned object with a melee Natural Weapon attack, you can grapple it. You can have only one creature or object grappled in this way. You have advantage on attack rolls against creatures grappled in this way. If you are grappling a creature or an object, you can still make attacks with your Natural Weapons but only against it."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Hungry Jaws",
                            "entries": [
                                "You can throw yourself into a feeding frenzy. As a bonus action, you can make a special attack with your Natural Weapon. If the attack hits, it deals its normal damage, and you gain temporary hit points equal to your proficiency bonus. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Massive Build",
                            "entries": [
                                "You have advantage on Strength-based ability checks and Strength saving throws. In addition, you count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Natural Armor",
                            "entries": ["You have tough, scaly skin. Bludgeoning, piercing, and slashing damage that you take from non-magical attacks is reduced by 2. When you aren't wearing any armor, your base AC is 13 + Constitution modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Prodigious Leap",
                            "entries": [
                                "As a bonus action, you can jump a number of feet equal to five times your proficiency bonus, without provoking opportunity attacks. You can use this trait only if your speed is greater than 0. You can use it a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Smart",
                            "entries": [
                                "Thanks to your supernaturally good memory, you have proficiency in one skill or tool of your choice. Moreover, when you make an ability check using any skill in which you have proficiency, you can give yourself advantage on the check before rolling the d20. You can give yourself advantage in this way a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Sprinter",
                            "entries": ["Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Venomous",
                            "entries": [
                                "You have advantage on saving throws against poison, and you have resistance against poison damage. When you hit a creature with your Natural Weapon unleash poison from it. The target makes a Constitution saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d6 poison damage. On a successful save, it takes half as much damage. This damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6). You can use this poison a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                            ]
                        }
                    ]
                }
            ],
            "type": "entries"
        }
    ],
    "hasFluff": false,
    "hasFluffImages": false
}